clc;
clear;
close all;
warning off

%% 载入数据
data.map=xlsread('data_large.xlsx',1); %载入Excel中第一个sheet的地图
data.sizeMap=size(data.map);

%% 数据初始化操作

% S = [3,3;1,16;5,26;2,45;4,66;12,71;21,69;17,64;11,47;9,27];  % 起点集合
% E = [1,16;5,26;2,45;4,66;12,71;21,69;17,64;11,47;9,27;3,3];  % 终点集合
% S = [3,3;17,28;21,39;25,42;31,44;42,67;45,50;34,30];  % 起点集合
% E = [17,28;21,39;25,42;31,44;42,67;45,50;34,30;3,3];  % 终点集合
S = [3,3;74,68];  % 起点集合
E = [74,68;3,3];  % 终点集合
% S = [3,3;12,5;20,13;42,28;70,47;83,39;71,29];  % 起点集合
% E = [12,5;20,13;42,28;70,47;83,39;71,29;3,3];  % 终点集合
% S = [3,3;39,4;49,5;64,7;73,22;84,19;80,4];  % 起点集合
% E = [39,4;49,5;64,7;73,22;84,19;80,4;3,3];  % 终点集合
for i = 1:size(S,1)
    [data_fin,result(i)] = PATH_find(S(i,:),E(i,:),data);
end
str = 'ERRT-GA';
CVRP_draw(S,result,data_fin,str);
sum_all = 0;
for i = 1:size(S,1)
    sum_all = sum_all+result(i).fit;
end
disp(sum_all);